misc/processTransaction.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header>
        <RequestSOAPHeader xmlns="http://www.huawei.com.cn/schema/common/v2_1">
            <spId>881188</spId>
            <spPassword>QkE1RjY1RDI0QjE2QjM4MDQ2Mjk2MUQzMjFEMkQ2MEEwRjRDMDg2RENCNzA5REI5RTk4M0ZCQzE0ODY1Q0U2MA==</spPassword>
            <serviceId>881188000</serviceId>
            <timeStamp>20170310101900</timeStamp>
        </RequestSOAPHeader>
    </SOAP-ENV:Header
    >
    <SOAP-ENV:Body>
        <ns5:RequestMsg xmlns:ns2="http://www.huawei.com.cn/schema/common/v2_1"
                        xmlns:ns3="http://api-v1.gen.mm.vodafone.com/mminterface/result" xmlns:ns4="http://api-v1.gen.mm.vodafone.com/mminterface/response" xmlns:ns5="http://api-v1.gen.mm.vodafone.com/mminterface/request">
            <ns5:Transaction>
                <ns5:CommandId>BusinessPayment
                </ns5:CommandId>
                <ns5:LanguageCode/>
                <ns5:OriginatorConversationID>65a45c92-c4b7-42e7-8ef0-efce918c410d-20170310101854480
                </ns5:OriginatorConversationID>
                <ns5:ConversationID/>
                <ns5:Remark>
                    Christmas Bonus
                </ns5:Remark>
                <ns5:Parameters>
                    <ns5:Parameter>
                        <ns5:Key>Amount</ns5:Key>
                        <ns5:Value>20</ns5:Value>
                    </ns5:Parameter>
                </ns5:Parameters>
                <ns5:ReferenceData>
                    <ns5:ReferenceItem>
                        <ns5:Key>Occassion</ns5:Key>
                        <ns5:Value>Jamhuri</ns5:Value>
                    </ns5:ReferenceItem>
                </ns5:ReferenceData>
                <ns5:Timestamp>2017-03-10T10:18:54.00581+0300</ns5:Timestamp>
            </ns5:Transaction>
            <ns5:Identity>
                <ns5:Caller>
                    <ns5:CallerType>0</ns5:CallerType>
                    <ns5:ThirdPartyID>BlueSky</ns5:ThirdPartyID>
                    <ns5:Password>BlueSky</ns5:Password>
                    <ns5:CheckSum>check
                        sum0
                    </ns5:CheckSum>
                    <ns5:ResultURL>http://10.64.0.236:7020/mpesa/result</ns5:ResultURL>
                </ns5:Caller>
                <ns5:Initiator>
                    <ns5:IdentifierType>1</ns5:IdentifierType>
                    <ns5:Identifier>
                        crystal
                    </ns5:Identifier>
                    <ns5:SecurityCredential>D6MkFLPIn8df27Iu4V+WsA==</ns5:SecurityCredential>
                    <ns5:ShortCode xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">12345
                    </ns5:ShortCode>
                </ns5:Initiator>
                <ns5:PrimaryParty>
                    <ns5:IdentifierType>1</ns5:IdentifierType>
                    <ns5:Identifier>
                        880072
                    </ns5:Identifier>
                    <ns5:ShortCode>880072</ns5:ShortCode>
                </ns5:PrimaryParty>
                <ns5:ReceiverParty>
                    <ns5:IdentifierType>4</ns5:IdentifierType>
                    <ns5:Identifier>12345
                    </ns5:Identifier>
                    <ns5:ShortCode>12345</ns5:ShortCode>
                </ns5:ReceiverParty>
                <ns5:AccessDevice>
                    <ns5:IdentifierType>1</ns5:IdentifierType>
                    <ns5:Identifier>identifier1</ns5:Identifier>
                </ns5:AccessDevice>
            </ns5:Identity>
            <ns5:KeyOwner>1</ns5:KeyOwner>
        </ns5:RequestMsg>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>